# Store casks in the local applications directory.
cask_args appdir: "~/Applications", require_sha: true

# Install system programs.
brew "bash"
brew "chruby"
brew "curl"
brew "curl"
brew "diff-so-fancy"
brew "fnm"
brew "git"
brew "pandoc"
brew "postgresql"
brew "ripgrep"
brew "ruby-install"
brew "sqlite"
brew "wget"
brew "yarn"
brew "youtube-dl"

# Install GUI programs.
cask "basictex"
cask "dash"
cask "karabiner-elements"
cask "firefox"
cask "iterm2"
cask "spotify"
cask "1password"
